tutorials/verificationAndValidation/multiphase/interIsoFoam/porousDamBreak/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

vertices
(
    //x y z
    (0 0 0)
    (30 0 0)
    (59 0 0)
    (89.2 0 0)
    (0 37 0)
    (30 37 0)
    (59 37 0)
    (89.2 37 0)
    (0 58 0)
    (30 58 0)
    (59 58 0)
    (89.2 58 0)

    (0 0 0.1)
    (30 0 0.1)
    (59 0 0.1)
    (89.2 0 0.1)
    (0 37 0.1)
    (30 37 0.1)
    (59 37 0.1)
    (89.2 37 0.1)
    (0 58 0.1)
    (30 58 0.1)
    (59 58 0.1)
    (89.2 58 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (75 93 1) simpleGrading (1 1 1)
    hex (1 2 6 5 13 14 18 17) porosity (73 93 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (76 93 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (75 53 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (73 53 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (76 53 1) simpleGrading (1 1 1)
);

patches
(
    wall leftWall
    (
        (0 12 16 4)
        (4 16 20 8)
    )
    wall rightWall
    (
        (3 15 19 7)
        (7 19 23 11)
    )
    wall lowerWall
    (
        (0 1 13 12)
        (1 2 14 13)
        (2 3 15 14)
    )
    patch atmosphere
    (
        (8 9 21 20)
        (9 10 22 21)
        (10 11 23 22)
    )
);


// ************************************************************************* //
